{
  "themeColor": "#26a69a",
  "introduction": {
    "profileName": "Jefree Sujit E",
    "profileImgLink": "assets/images/photo.png",
    "presentRole": "Lead Software Engineer",
    "presentCompany": "Memorang Inc.",
    "companyUrl": "https://memorang.com",
    "profileBio": [
      "✪ Computer Science Graduate ✪ Lives in Chennai, India",
      "✪ Web developer ✪ JS Lover ✪ Crypto Enthusiast",
      "✪ Anime Fan ✪ Marvel Freak ✪ Guitar Noob"
    ],
    "referenceLinks": {
      "github": "https://github.com/jefreesujit",
      "stackoverflow": "https://stackoverflow.com/users/2299439/jefree-sujit",
      "linkedin": "https://www.linkedin.com/in/jefreesujit",
      "npm": "https://www.npmjs.com/~jefreesujit",
      "openuserjs": "https://openuserjs.org/users/Jefreesujit/scripts"
    }
  },
  "experience": {
    "jobsList": [{
      "jobTitle": "Lead Software Engineer",
      "companyName": "Memorang Labs",
      "fromDate": "Jan 2021",
      "toDate": "Present",
      "description": [
        "Building modular and high performant white labeled apps for partners using React, React Native and Typescript",
        "Design a scalable multi tenant backend architecture which serves multiple partner apps with a single database.",
        "Build a highly performant event driven micro service architecture, designed to handle heavy loads."
      ]
    }, {
      "jobTitle": "Senior Software Engineer",
      "companyName": "Memorang Labs",
      "fromDate": "Jul 2019",
      "toDate": "Jan 2021",
      "description": [
        "Creating an highly scalable serverless infrastructure with Node.js and GraphQL using AppSync, API Gateway and Lambda",
        "Implemented the end-to-end payment setup from Web UI to Backend to integrating with external services. Experience in working with Stripe payments and In-app purchase integration for mobile devices.",
        "Developing a modular and high performant web and mobile application using React.js and React Native",
        "Built an in-house customized Graph Database over AWS DynamoDB"
      ]
    }, {
      "jobTitle": "Front End Engineer",
      "companyName": "The Advisory Board Company",
      "fromDate": "Apr 2018",
      "toDate": "Jul 2019",
      "description": [
        "Firm rooting the \"Console\" application with solid technology stacks, making it more modular and as a platform application to support for any framework to be built in",
        "Enhancing the middle tier server to handle cross-application requests as a platform, with authentication and authorization and serving custom user role based features",
        "Working on AWS migrating application to cloud, handling traffic with load balancing and autoscaling, improving performance and reducing cost"
      ]
    }, {
      "jobTitle": "Associate Front End Engineer",
      "companyName": "The Advisory Board Company",
      "fromDate": "Jun 2016",
      "toDate": "Mar 2018",
      "description": [
        "Building a Member Self-Service Application \"Console\", an Enterprise Level SPA with Material Inspired designs for user-friendly experience. ES6, React.js, Redux, SASS, Webpack",
        "Building the Middle-Tier Server for WebApp, serving data requests from WebApp and authentication for requests from external sources. NPM, Node.js, Express.js"
      ]
    }, {
      "jobTitle": "Engineering Intern",
      "companyName": "The Advisory Board Company",
      "fromDate": "Jan 2016",
      "toDate": "May 2016",
      "description": [
        "Built an React based Configuration Management Web Application for Internal users to display metrics, monitor activity and configure settings"
      ]
    }]
  },
  "skills": {
    "primary": [{
      "skillName": "ReactJS",
      "level": 7
    }, {
      "skillName": "Node.js",
      "level": 7
    }, {
      "skillName": "AWS",
      "level": 6
    }, {
      "skillName": "Python",
      "level": 6
    }],
    "secondary": [{
      "skillName": "GraphQL",
      "level": 7
    }, {
      "skillName": "Serverless",
      "level": 7
    }, {
      "skillName": "React Native",
      "level": 6
    }, {
      "skillName": "TypeScript",
      "level": 6
    }, {
      "skillName": "Angular",
      "level": 5
    }]
  },
  "projects": {
    "personal": [{
      "title": "AnyZip",
      "link": "/anyzip",
      "description": "An online ZIP converter that lets you easily compress your files to the ZIP format. You can upload any number of files, any type of files and our converter will compress it for you."
    }, {
      "title": "Birthday Tracker",
      "link": "/birthdaytracker/public",
      "description": "An App to keep track of Birthday list. Designed with Material Concept, uses Google Sign-in for Authentication and Google Firebase for storage"
    }, {
      "title": "Chatter Box",
      "link": "https://mychatterbox.herokuapp.com",
      "description": "An simple chat application that allows you to create rooms and chat in groups. Node based application built using Express.js server. Designed with Material Concept and uses Socket.io for message transfer"
    }, {
      "title": "DriveIt",
      "link": "https://driveit.us-west-2.elasticbeanstalk.com",
      "description": "Drive It is a cloud-based web application, that allows you to store, retrieve and manage files over the cloud. It is absolutely free to use, at no cost limit and with no storage limit. Drive It is powered by Node.js and Amazon Web Services (AWS)"
    }, {
      "title": "Easy Miner",
      "link": "/easyminer",
      "description": "An application that allows users to mine cryptocurrencies in mining pools directly from browser. The user can connect to which ever mining pool the user wants, with no external setup and with minimal configuration"
    }, {
      "title": "Face Detect",
      "link": "https://facedetect.netlify.com/",
      "description": "An experiment over google chrome's face detection api. Just try some images with faces or try your own face in the live camera, the app would identify the faces and draws boxes over it!"
    }, {
      "title": "Hurl",
      "link": "https://hurl.vercel.app/",
      "description": "Hurl is a free tool to shorten links and URLs. Its totally free to use with unlimited shortening of URLs and Strictly no ADs. It also provides an API service to generate shortened URLs programatically for free as well!"
    }, {
      "title": "Learnings Today",
      "link": "https://play.google.com/store/apps/details?id=com.app.learningstoday",
      "description": "Learnings Today is a simple learnings tracker app that enables you to note down your everyday learnings and helps you to manage them. It also provides a personalised learning timeline for you where you can revisit your learnings and recall them"
    }],
    "university": [{
      "title": "Cypher It",
      "link": "",
      "description": "Simulated a real-time “Cryptography” project that involves end-to-end encrypted chat option and encrypted file transfer which uses custom algorithms to withstand attacks and secured with user identity authentication on both ends."
    }, {
      "title": "Member Self-Service Tool",
      "link": "",
      "description": "Contributed in building a Web Application that would assess data readiness, collect the data needed for any products engagement, and prepare the data for use across all products."
    }]
  },
  "endCard": {
    "title": "That's it!",
    "caption": "Thanks for your time and patience :)",
    "message": "Wanna get in touch? ",
    "email": "jefreesujit@gmail.com"
  }
}
